Revit 2027 API
BoundaryConditions.GetLoops Method
 Returns curve loops that define geometry of the area boundary conditions.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<CurveLoop> GetLoops()
Public Function GetLoops As IList(Of CurveLoop)
public:
IList<CurveLoop^>^ GetLoops()
member GetLoops : unit -> IList<CurveLoop>
Return Value
IList<CurveLoop>
 The curve loop collection.
Exceptions
Exception | Condition
InvalidObjectException |  Boundary condition is not a BoundaryConditionsType::Area type.
Remarks
 Boundary conditions should be BoundaryConditionsType::Area type. Otherwise exception is thrown.
See Also
Reference
BoundaryConditions Class
Autodesk.Revit.DB.Structure Namespace